Team612/612-PSoC/2020-Control-Scheme.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Internal_LED_aliases.h"
#include "Internal_LED.h"
#include "USB.h"
#include "USB_audio.h"
#include "USB_cdc.h"
#include "USB_hid.h"
#include "USB_midi.h"
#include "USB_pvt.h"
#include "USB_cydmac.h"
#include "USB_msc.h"
#include "Clock.h"
#include "Pin_1_8_aliases.h"
#include "Pin_1_8.h"
#include "Pin_9_11_aliases.h"
#include "Pin_9_11.h"
#include "Status_1_8.h"
#include "Status_9_11.h"
#include "LED_15_0_aliases.h"
#include "LED_15_0.h"
#include "LEDs_1_8.h"
#include "LED_15_1_aliases.h"
#include "LED_15_1.h"
#include "LED_15_2_aliases.h"
#include "LED_15_2.h"
#include "LED_15_3_aliases.h"
#include "LED_15_3.h"
#include "LED_15_4_aliases.h"
#include "LED_15_4.h"
#include "LED_15_5_aliases.h"
#include "LED_15_5.h"
#include "LED_12_2_aliases.h"
#include "LED_12_2.h"
#include "LED_12_3_aliases.h"
#include "LED_12_3.h"
#include "LEDs_9_10.h"
#include "LED_12_4_aliases.h"
#include "LED_12_4.h"
#include "LED_12_5_aliases.h"
#include "LED_12_5.h"
#include "USB_Dm_aliases.h"
#include "USB_Dm.h"
#include "USB_Dp_aliases.h"
#include "USB_Dp.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

